WiFiConfig/esp_wifi_config/examples/with_webui_customize/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Enable WiFi Config Web UI, served from a LittleFS partition
CONFIG_WIFI_CFG_ENABLE_WEBUI=y
CONFIG_WIFI_CFG_WEBUI_SOURCE_FILESYSTEM=y
CONFIG_WIFI_CFG_WEBUI_CUSTOM_PATH="/littlefs"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
